Notas
# Andres Javier galindo Vargas
# A01793927

In [2]:
import pandas as pd

In [3]:
#Define un dictionario 'x'

x = {'Name': ['Rose','John', 'Jane', 'Mary'], 'ID': [1, 2, 3, 4], 'Department': ['Architect Group', 'Software Group', 'Design Team', 'Infrastructure'], 
      'Salary':[100000, 80000, 50000, 60000]}

#casting the dictionary to a DataFrame
df = pd.DataFrame(x)

#display the result df
df

   Name  ID       Department  Salary
0  Rose   1  Architect Group  100000
1  John   2   Software Group   80000
2  Jane   3      Design Team   50000
3  Mary   4   Infrastructure   60000

In [ ]:
#Recuperando la columna "ID" y asignándola a una variable x
x = df[['ID']]
x

   ID
0   1
1   2
2   3
3   4

In [ ]:
#comprobar el tipo de x
type(x)

pandas.core.frame.DataFrame

In [ ]:
#Recuperando las columnas Departamento, Salario e ID y asignándolas a una variable z

z = df[['Department','Salary','ID']]
z

        Department  Salary  ID
0  Architect Group  100000   1
1   Software Group   80000   2
2      Design Team   50000   3
3   Infrastructure   60000   4

In [ ]:
# crear df con diccionarios 
a = {'Student':['David', 'Samuel', 'Terry', 'Evan'],
     'Age':['27', '24', '22', '32'],
     'Country':['UK', 'Canada', 'China', 'USA'],
     'Course':['Python','Data Structures','Machine Learning','Web Development'],
     'Marks':['85','72','89','76']}
df1 = pd.DataFrame(a)
df1

  Student Age Country            Course Marks
0   David  27      UK            Python    85
1  Samuel  24  Canada   Data Structures    72
2   Terry  22   China  Machine Learning    89
3    Evan  32     USA   Web Development    76

In [ ]:
b = df1[['Marks']]
b

  Marks
0    85
1    72
2    89
3    76

In [ ]:
# quiz
c = df1[['Country','Course']]
c

  Country            Course
0      UK            Python
1  Canada   Data Structures
2   China  Machine Learning
3     USA   Web Development

In [ ]:
# Obtenga la columna Nombre como un objeto de serie

x = df['Name']
x

0    Rose
1    John
2    Jane
3    Mary
Name: Name, dtype: object

In [ ]:
#comprobar el tipo de x
type(x)

pandas.core.series.Series

In [ ]:
# Acceda al valor en la primera fila y la primera columna

df.iloc[0, 0]

'Rose'

In [ ]:
# Acceda al valor en la primera fila y la tercera columna

df.iloc[0,2]

'Architect Group'

In [ ]:
# Acceda a la columna usando el nombre

df.loc[0, 'Salary']

100000

In [ ]:
df2=df
df2=df2.set_index("Name")

In [ ]:
#mostrar las primeras 5 fila
df2.head()

      ID       Department  Salary
Name
Rose   1  Architect Group  100000
John   2   Software Group   80000
Jane   3      Design Team   50000
Mary   4   Infrastructure   60000

In [ ]:
#Ahora, accedamos a la columna usando el nombre
df2.loc['Jane', 'Salary']

50000

In [ ]:
df2.loc['Jane', 'Department']

'Design Team'

In [ ]:
df2.iloc[3,2]

60000

In [ ]:
# seleccion de datos anmterior df

df.iloc[0:2, 0:3]

In [ ]:
df.loc[0:2,'ID':'Department']

In [ ]:
df2.loc['Rose':'Jane', 'ID':'Department']